src/Reports/ВизуализацияЗаказовНаПроизводство/ВизуализацияЗаказовНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВизуализацияЗаказовНаПроизводство</name>
</mdclass:Report>

src/AccumulationRegisters/ЗаказыНаПроизводство/ЗаказыНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыНаПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/МаршрутнаяКарта/МаршрутнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутнаяКарта</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.РемонтнаяКарта</basedOn>
  <basedOn>Document.СписаниеМПЗПрочее</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИнициатор</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияПотребитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредполагаемогоОкончанияОстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторОстановки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗОстановки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.СтандартныеКомментарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остановки</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредполагаемая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныОстановок</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Инициатор</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ВизуализацияЗаказовНаПроизводство/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьМТК(ЗаказНаПроизводство,Продукция)
СписокМТК = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Ссылка
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.ДокументОснование = &ДокументОснование
	|	И МаршрутнаяКарта.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаршрутнаяКарта.Дата";
Запрос.УстановитьПараметр("ДокументОснование",ЗаказНаПроизводство);	
Запрос.УстановитьПараметр("Номенклатура",Продукция);	
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    СписокМТК.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(СписокМТК);
КонецФункции 

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблЗНП = Макет.ПолучитьОбласть("ЗНП");
ОблМТК = Макет.ПолучитьОбласть("МТК");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыНаПроизводствоОстатки.Документ КАК Документ,
	|	ЗаказыНаПроизводствоОстатки.Продукция КАК Продукция,
	|	ЗаказыНаПроизводствоОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Остатки КАК ЗаказыНаПроизводствоОстатки
	|ГДЕ
	|	ЗаказыНаПроизводствоОстатки.КоличествоОстаток > 0";
	Если ЗначениеЗаполнено(НомерСчёта) Тогда
	Запрос.Текст = Запрос.Текст + " И ЗаказыНаПроизводствоОстатки.Документ.Номер ПОДОБНО &Номер";
	Запрос.УстановитьПараметр("Номер",НомерСчёта+"%");
	КонецЕсли;
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	ЗаказыНаПроизводствоОстатки.Документ.ДатаОтгрузкиОбещанная,
								|	ЗаказыНаПроизводствоОстатки.Продукция.Наименование
								|ИТОГИ
								|	СУММА(КоличествоОстаток)
								|ПО
								|	Документ,
								|	Продукция"; 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокумент.Следующий() Цикл
	ОблЗНП.Параметры.НомерЗНП = СокрЛП(ВыборкаДокумент.Документ.Номер);
	ОблЗНП.Параметры.ЗНП = ВыборкаДокумент.Документ;
	ОблЗНП.Параметры.ДатаОтгрузки = Формат(ВыборкаДокумент.Документ.ДатаОтгрузкиОбещанная,"ДФ=dd.MM.yyyy");
	ОблЗНП.Параметры.ТорговыйДом = ВыборкаДокумент.Документ.ТорговыйДом;
	ТабДок.Вывести(ОблЗНП);
	ВыборкаПродукция = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПродукция.Следующий() Цикл
		СписокМТК = ПолучитьМТК(ВыборкаДокумент.Документ,ВыборкаПродукция.Продукция);
			Если СписокМТК.Количество() > 0 Тогда
				Для каждого МТК Из СписокМТК Цикл
				КолВПроизводстве = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),МТК.Значение);
					Если КолВПроизводстве > 0 Тогда
					ОблМТК.Параметры.НомерМТК = МТК.Значение.Номер;
					ОблМТК.Параметры.МТК = МТК.Значение;
					ОблМТК.Параметры.Изделие = МТК.Значение.Номенклатура;
					ОблМТК.Параметры.Кол = МТК.Значение.Количество;
					ОблМТК.Параметры.КолВПроизводстве = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),МТК.Значение);
					ОблМТК.Параметры.СтандартныйКомментарий = МТК.Значение.СтандартныйКомментарий;
					ОблМТК.Параметры.ДатаОтгрузки = Формат(МТК.Значение.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
					ТабДок.Вывести(ОблМТК);
					КонецЕсли;
				 КонецЦикла;
			Иначе
			ОблМТК.Параметры.НомерМТК = "нет";
			ОблМТК.Параметры.МТК = "";
			ОблМТК.Параметры.Изделие = ВыборкаПродукция.Продукция;
			ОблМТК.Параметры.Кол = ВыборкаПродукция.КоличествоОстаток;
			ОблМТК.Параметры.КолВПроизводстве = 0;
			ОблМТК.Параметры.СтандартныйКомментарий = "";
			ОблМТК.Параметры.ДатаОтгрузки = "";
			ТабДок.Вывести(ОблМТК);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
